%Ορίζουμε τις f1,f2,f3 με την εντολή syms για να μπορούμε να
%χρησιμοποιήσουμε την εντολή diff(function,'x') για τον υπολογισμό των
%παραγώγων τους
syms x
f1 = (x-2)^2 - sin(x+3);
f2 = exp(-5*x) + (x+2)*cos(0.5*x)^2;
f3 = x^2*sin(x+2) - (x+1)^2;

%Πίνακας Συναρτήσεων f1, f2, f3
functions = [f1 f2 f3];

%Άκρα διαστήματος [α,β]
a = 2;
b = 5;

%Ορισμός μηδενικού πίνακα 1Χ10 για τις δίαφορες τιμές του l
l = zeros(1,10);

%Ορισμός μηδενικού πίνακα 3Χ10 για κάθε κλήση της συνάρτησης
count = zeros(3,10);

for i = 1:3
    for j = 1:10
        
        %Μεταβολή του l σε κάθε επανάληψη
       l(j) = 0.001*(2 + 1/0.5^(j));
        
        %Αλγόριθμος Διχοτόμισης με χρήση Παραγώγου
        n = 1;
        
        while 0.5^n > l(j)/3
            
            n = n + 1;
            
        end
        
        for k = 1:n
            
            x_k = (a+b)/2;
            
            %Γίνεται μια κλήση σε κάθε επανάληψη
			count(i,j) = count(i,j) + 1;
            
            %Υπολογισμός παραγώγου της συνάρτησης...
            Df(x) = diff(functions(i), 'x');
            
            %...στο σημείο xk
            Df_xk = Df(x_k);
            
			if Df_xk > 0
                b = x_k;
            elseif Df_xk < 0
				a = x_k;
            end
        end
    end
end 

%Tα διαγράμματα
plot(l, count(1,:))
hold on
plot(l, count(2,:))
hold on
plot(l, count(3,:))

xlabel('l')
ylabel('counts')
title('f1, f2, f3')